# Brewfile — declarative Homebrew dependencies
# Install everything with: brew bundle

# ─── Shell ───────────────────────────────────────────────────────────────────
brew "zsh-autosuggestions"
brew "zsh-syntax-highlighting"
brew "starship"          # cross-shell prompt
brew "zoxide"            # smarter cd
brew "direnv"            # per-project env vars

# ─── Terminal ────────────────────────────────────────────────────────────────
brew "tmux"
cask "ghostty"

# ─── CLI essentials ──────────────────────────────────────────────────────────
brew "fzf"               # fuzzy finder
brew "gh"                # GitHub CLI
brew "git"               # newer than macOS system git
brew "git-delta"         # better git diffs
brew "lazygit"           # terminal UI for git
brew "gnupg"             # GPG for commit signing
brew "ripgrep"           # fast grep (rg)
brew "fd"                # fast find
brew "bat"               # better cat
brew "eza"               # better ls
brew "htop"              # process viewer
brew "tree"              # directory tree
brew "wget"              # file downloader
brew "jq"                # JSON processor
brew "tldr"              # practical command examples
brew "ncdu"              # interactive disk usage
brew "mkcert"            # local HTTPS certs
brew "coreutils"         # GNU coreutils (replaces BSD versions)
brew "mas"               # Mac App Store CLI

# ─── Development ─────────────────────────────────────────────────────────────
brew "python@3.14"
brew "mise"              # runtime version manager (node, python, go, etc.)

# ─── Fonts ───────────────────────────────────────────────────────────────────
cask "font-fira-code-nerd-font"
cask "font-symbols-only-nerd-font"

# ─── GUI Apps ────────────────────────────────────────────────────────────────
cask "visual-studio-code"
cask "raycast"           # Spotlight replacement + productivity launcher
cask "rectangle"         # Window manager
cask "docker"            # Docker Desktop — requires: sudo mkdir -p /usr/local/cli-plugins
